HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxInt_bf.h
/** \\brief  Mask for Ifx_INT_OIXTS_Bits.TGS */
#define IFX_INT_OIXTS_TGS_MSK (0x3)

/** \\brief  Offset for Ifx_INT_OIXTS_Bits.TGS */
#define IFX_INT_OIXTS_TGS_OFF (0)

/** \\brief  Length for Ifx_INT_OMISN_Bits.OTGB0 */
#define IFX_INT_OMISN_OTGB0_LEN (16)

/** \\brief  Mask for Ifx_INT_OMISN_Bits.OTGB0 */
#define IFX_INT_OMISN_OTGB0_MSK (0xffff)

/** \\brief  Offset for Ifx_INT_OMISN_Bits.OTGB0 */
#define IFX_INT_OMISN_OTGB0_OFF (0)

/** \\brief  Length for Ifx_INT_OMISN_Bits.OTGB1 */
#define IFX_INT_OMISN_OTGB1_LEN (16)

/** \\brief  Mask for Ifx_INT_OMISN_Bits.OTGB1 */
#define IFX_INT_OMISN_OTGB1_MSK (0xffff)

/** \\brief  Offset for Ifx_INT_OMISN_Bits.OTGB1 */
#define IFX_INT_OMISN_OTGB1_OFF (16)

/** \\brief  Length for Ifx_INT_OMISP_Bits.OTGB0 */
#define IFX_INT_OMISP_OTGB0_LEN (16)

/** \\brief  Mask for Ifx_INT_OMISP_Bits.OTGB0 */
#define IFX_INT_OMISP_OTGB0_MSK (0xffff)

/** \\brief  Offset for Ifx_INT_OMISP_Bits.OTGB0 */
#define IFX_INT_OMISP_OTGB0_OFF (0)

/** \\brief  Length for Ifx_INT_OMISP_Bits.OTGB1 */
#define IFX_INT_OMISP_OTGB1_LEN (16)

/** \\brief  Mask for Ifx_INT_OMISP_Bits.OTGB1 */
#define IFX_INT_OMISP_OTGB1_MSK (0xffff)

/** \\brief  Offset for Ifx_INT_OMISP_Bits.OTGB1 */
#define IFX_INT_OMISP_OTGB1_OFF (16)

/** \\brief  Length for Ifx_INT_OOBS_Bits.OTGB0 */
#define IFX_INT_OOBS_OTGB0_LEN (16)

/** \\brief  Mask for Ifx_INT_OOBS_Bits.OTGB0 */
#define IFX_INT_OOBS_OTGB0_MSK (0xffff)

/** \\brief  Offset for Ifx_INT_OOBS_Bits.OTGB0 */
#define IFX_INT_OOBS_OTGB0_OFF (0)

/** \\brief  Length for Ifx_INT_OOBS_Bits.OTGB1 */
#define IFX_INT_OOBS_OTGB1_LEN (16)

/** \\brief  Mask for Ifx_INT_OOBS_Bits.OTGB1 */
#define IFX_INT_OOBS_OTGB1_MSK (0xffff)

/** \\brief  Offset for Ifx_INT_OOBS_Bits.OTGB1 */
#define IFX_INT_OOBS_OTGB1_OFF (16)

/** \\brief  Length for Ifx_INT_OSSIC_Bits.TGB */
#define IFX_INT_OSSIC_TGB_LEN (1)

/** \\brief  Mask for Ifx_INT_OSSIC_Bits.TGB */
#define IFX_INT_OSSIC_TGB_MSK (0x1)

/** \\brief  Offset for Ifx_INT_OSSIC_Bits.TGB */
#define IFX_INT_OSSIC_TGB_OFF (2)

/** \\brief  Length for Ifx_INT_OSSIC_Bits.TGS */
#define IFX_INT_OSSIC_TGS_LEN (2)

/** \\brief  Mask for Ifx_INT_OSSIC_Bits.TGS */
#define IFX_INT_OSSIC_TGS_MSK (0x3)

/** \\brief  Offset for Ifx_INT_OSSIC_Bits.TGS */
#define IFX_INT_OSSIC_TGS_OFF (0)

/** \\brief  Length for Ifx_INT_SRB0_Bits.TRIG0 */
#define IFX_INT_SRB0_TRIG0_LEN (1)

/** \\brief  Mask for Ifx_INT_SRB0_Bits.TRIG0 */
#define IFX_INT_SRB0_TRIG0_MSK (0x1)

/** \\brief  Offset for Ifx_INT_SRB0_Bits.TRIG0 */
#define IFX_INT_SRB0_TRIG0_OFF (0)

/** \\brief  Length for Ifx_INT_SRB0_Bits.TRIG1 */
#define IFX_INT_SRB0_TRIG1_LEN (1)

/** \\brief  Mask for Ifx_INT_SRB0_Bits.TRIG1 */
#define IFX_INT_SRB0_TRIG1_MSK (0x1)

/** \\brief  Offset for Ifx_INT_SRB0_Bits.TRIG1 */
#define IFX_INT_SRB0_TRIG1_OFF (1)

/** \\brief  Length for Ifx_INT_SRB0_Bits.TRIG2 */
#define IFX_INT_SRB0_TRIG2_LEN (1)

/** \\brief  Mask for Ifx_INT_SRB0_Bits.TRIG2 */
#define IFX_INT_SRB0_TRIG2_MSK (0x1)

/** \\brief  Offset for Ifx_INT_SRB0_Bits.TRIG2 */
#define IFX_INT_SRB0_TRIG2_OFF (2)

/** \\brief  Length for Ifx_INT_SRB0_Bits.TRIG3 */
#define IFX_INT_SRB0_TRIG3_LEN (1)

/** \\brief  Mask for Ifx_INT_SRB0_Bits.TRIG3 */
#define IFX_INT_SRB0_TRIG3_MSK (0x1)

/** \\brief  Offset for Ifx_INT_SRB0_Bits.TRIG3 */
#define IFX_INT_SRB0_TRIG3_OFF (3)

/** \\brief  Length for Ifx_INT_SRB1_Bits.TRIG0 */
#define IFX_INT_SRB1_TRIG0_LEN (1)

/** \\brief  Mask for Ifx_INT_SRB1_Bits.TRIG0 */
#define IFX_INT_SRB1_TRIG0_MSK (0x1)

/** \\brief  Offset for Ifx_INT_SRB1_Bits.TRIG0 */
#define IFX_INT_SRB1_TRIG0_OFF (0)

/** \\brief  Length for Ifx_INT_SRB1_Bits.TRIG1 */
#define IFX_INT_SRB1_TRIG1_LEN (1)

/** \\brief  Mask for Ifx_INT_SRB1_Bits.TRIG1 */
#define IFX_INT_SRB1_TRIG1_MSK (0x1)

/** \\brief  Offset for Ifx_INT_SRB1_Bits.TRIG1 */
#define IFX_INT_SRB1_TRIG1_OFF (1)

/** \\brief  Length for Ifx_INT_SRB1_Bits.TRIG2 */
#define IFX_INT_SRB1_TRIG2_LEN (1)

/** \\brief  Mask for Ifx_INT_SRB1_Bits.TRIG2 */
#define IFX_INT_SRB1_TRIG2_MSK (0x1)

/** \\brief  Offset for Ifx_INT_SRB1_Bits.TRIG2 */
#define IFX_INT_SRB1_TRIG2_OFF (2)

/** \\brief  Length for Ifx_INT_SRB1_Bits.TRIG3 */
#define IFX_INT_SRB1_TRIG3_LEN (1)

/** \\brief  Mask for Ifx_INT_SRB1_Bits.TRIG3 */
#define IFX_INT_SRB1_TRIG3_MSK (0x1)

/** \\brief  Offset for Ifx_INT_SRB1_Bits.TRIG3 */
#define IFX_INT_SRB1_TRIG3_OFF (3)

/** \\brief  Length for Ifx_INT_SRB2_Bits.TRIG0 */
#define IFX_INT_SRB2_TRIG0_LEN (1)

/** \\brief  Mask for Ifx_INT_SRB2_Bits.TRIG0 */
#define IFX_INT_SRB2_TRIG0_MSK (0x1)

/** \\brief  Offset for Ifx_INT_SRB2_Bits.TRIG0 */
#define IFX_INT_SRB2_TRIG0_OFF (0)

/** \\brief  Length for Ifx_INT_SRB2_Bits.TRIG1 */
#define IFX_INT_SRB2_TRIG1_LEN (1)

/** \\brief  Mask for Ifx_INT_SRB2_Bits.TRIG1 */
#define IFX_INT_SRB2_TRIG1_MSK (0x1)

/** \\brief  Offset for Ifx_INT_SRB2_Bits.TRIG1 */
#define IFX_INT_SRB2_TRIG1_OFF (1)

/** \\brief  Length for Ifx_INT_SRB2_Bits.TRIG2 */
#define IFX_INT_SRB2_TRIG2_LEN (1)

/** \\brief  Mask for Ifx_INT_SRB2_Bits.TRIG2 */
#define IFX_INT_SRB2_TRIG2_MSK (0x1)

/** \\brief  Offset for Ifx_INT_SRB2_Bits.TRIG2 */
#define IFX_INT_SRB2_TRIG2_OFF (2)

/** \\brief  Length for Ifx_INT_SRB2_Bits.TRIG3 */
#define IFX_INT_SRB2_TRIG3_LEN (1)

/** \\brief  Mask for Ifx_INT_SRB2_Bits.TRIG3 */
#define IFX_INT_SRB2_TRIG3_MSK (0x1)

/** \\brief  Offset for Ifx_INT_SRB2_Bits.TRIG3 */
#define IFX_INT_SRB2_TRIG3_OFF (3)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXINT_BF_H */
